cavity/system/controlDict
FoamFile
{
	version 2.0;
	format ascii;
	class dictionary;
	object controlDict;
}

application simpleFoam;
startFrom startTime;
startTime 0;
stopAt endTime;
endTime 10;
deltaT 1;
timeFormat general;
timePrecision 6;
runTimeModifiable true;
witeControl timeStep;
writeInterval 1;
purgeWrite 5;
writeFormat ascii;
writePrecision 6;
writeCompression off;