cavity/system/snappyHexMeshDict
FoamFile
{
	version 2.0;
	format ascii;
	class dictionary;
	object snappyHexMeshDict;
}

castellatedMesh true;
snap true;
addLayers true;
geometry{
pipe.stl
{
type triSurfaceMesh;
}
refinementBox
{
type box;
min 0.4 0.25 0.65;
max 0.8 0.75 1.35;
}}

castellatedMeshControls
{
maxLocalCells 20000;
maxGlobalCells 5000;
minRefinementCells 1;
maxLoadUnbalance 0.1;
nCellsBetweenLevels 3;
refinementSurfaces{}

resolveFeatureAngle 30;
refinementRegions{}

locationInMesh (0 0 0);
allowFreeStandingZoneFaces true;
}
snapControls
{
noSmoothPatch 5;
tolerance 2.0;
nSolveIter 50;
nRelaxiter 7;
nFeatureSnapIter 15;
implicitFeatureSnap false;
explicitFeatureSnap true;
multiRegionFeatureSnap false;
}
addLayerControls
{
relativeSizes true;
layers{}

expansionRatio 1.15;
finalLayerThickenss 0.3;
minThickness 0.1;
nGrow 0;
featurAngle 60;
slipFeatureAngle 30;
nRelaxIter 3;
nSmoothSurfaceNormals 1;
nSmoothThickness 10;
maxFaceThicknessRatio 0.5;
maxThicknessToMedialRatio 0.3;
minMedialAxisAngle 90;
nBufferCellsNoExtrude 0;
nLayerIter 50;
}